app/controllers/home_controller.rb

  def index
    system "rake quote:get_all_qoute" if Quote.count == 0
    @quote = Quote.first
---
SELECT COUNT(*) FROM "quotes"
SELECT  "quotes".* FROM "quotes" ORDER BY "quotes"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def get_another_quote
    @quote = Quote.order("RANDOM()").first
---
SELECT  "quotes".* FROM "quotes" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]